; domain
(define (domain default)
  (:requirements :strips :typing :conditional-effects)  ; Specifies the requirements: STRIPS, ADL, and typing.
  (:types
    agent workstation warehouse box supply - locatable  ; Object supply_types.
    location supply_type carrier - object
  )
  (:predicates
    (adjacent ?l1 ?l2 - location)       ; Indicates that ?l1 is adjacent to ?l2.
    (at ?o - locatable ?l - location)  ; Indicates that object ?o is at location ?l.
    (empty ?b - box)   ; Indicates that ?b, a box, is empty.
    (free_arms ?a - agent) ; Indicates that agent ?a has free arms (not carrying a box).
    (box_carried_by ?b - box ?a - agent) ; Indicates that ?b, a box, is being carried by ?a, an agent.
    (contains ?b - box ?s - supply) ; Indicates that ?b, a box, contains ?s, a supply.
    (is ?s - supply ?t - supply_type) ; Indicates the supply_type ?t of a supply ?s.
    (has ?ws - workstation ?t - supply_type) ; Indicates that workstation ?ws requires a supply of supply_type ?t.
    (loaded_to ?s - supply ?ws - workstation) ; Indicates that supply ?s has been loaded to workstation ?ws.
    (unloaded_box ?b - box ?ws - workstation)
  )
  
  ;; Actions
  (:action move
    :parameters (?a - agent ?from ?to - location)
    :precondition (and 
      (adjacent ?from ?to)  ; Requires ?from to be adjacent to ?to.
      (at ?a ?from)  ; Agent ?a must be at the ?from location.
    )
    :effect (and 
      (at ?a ?to)  ; Agent ?a is now at ?to location.
      (not (at ?a ?from))  ; Agent ?a is no longer at ?from location.
    )
  )
  
  (:action take_box
    :parameters (?a - agent ?b - box ?l - location)
    :precondition (and 
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?b ?l)  ; Box ?b must be at ?l location.
      (free_arms ?a)  ; Agent ?a must have free arms.
    )
    :effect (and 
      (not (free_arms ?a))  ; Agent ?a no longer has free arms.
      (not (at ?b ?l))  ; Box ?b is no longer at ?l location.
      (box_carried_by ?b ?a)  ; Box ?b is now carried by agent ?a.
    )
  )
  
  (:action fill_box
    :parameters (?a - agent ?b - box ?s - supply ?l - location)
    :precondition (and 
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?s ?l)  ; Supply ?s must be at ?l location.
      (empty ?b)  ; Box ?b must be empty.
      (box_carried_by ?b ?a)
    )
    :effect (and 
      (not (empty ?b))  ; Box ?b is no longer empty.
      (contains ?b ?s)  ; Box ?b now contains supply ?s.
      (not (at ?s ?l))  ; Supply ?s is no longer at ?l location.
    )
  )

  (:action deliver_box
    :parameters (?a - agent ?b - box ?ws - workstation ?l - location)
    :precondition (and 
      (box_carried_by ?b ?a)  ; Box ?b must be carried by agent ?a.
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?ws ?l)
    )
    :effect (and 
      (free_arms ?a)  ; Agent ?a has free arms again.
      (not (box_carried_by ?b ?a))  ; Box ?b is no longer carried by agent ?a.
      (unloaded_box ?b ?ws)
    )
  )
    
  (:action deliver_supply
    :parameters (?a - agent ?ws - workstation ?t - supply_type ?s - supply ?b - box ?l - location )
    :precondition (and 
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?ws ?l)  ; Workstation ?ws must be at ?l location.
      (is ?s ?t)  ; Supply ?s must be of supply_type ?t.
      (unloaded_box ?b ?ws)
      (contains ?b ?s)  ; Box ?b must contain supply ?s.
      (free_arms ?a)
    )
    :effect (and 
      (loaded_to ?s ?ws)  ; Supply ?s is now loaded to workstation ?ws.
      (not (contains ?b ?s))  ; Box ?b no longer contains supply ?s.
      (not (unloaded_box ?b ?ws))
      (empty ?b)  ; Box ?b is now empty.
      (at ?b ?l)
      (has ?ws ?t)  ; Workstation ?ws now has a supply of supply_type ?t.
    )
  )
)

; problem
;; problem file: problem_0.pddl
(define (problem default)
  (:domain default)
  (:objects l0_2 l4_2 l3_4 l1_2 l1_3 l0_3 l4_1 l3_3 l0_0 l1_1 l0_1 l2_1 l1_0 l1_4 l2_0 l3_1 l3_0 l4_0 l4_3 l4_4 l3_2 l2_4 l2_3 l0_4 l2_2 - location agent_0 - agent supply_1 supply_0 supply_2 - supply box_4 box_0 box_7 box_1 box_8 box_5 box_3 box_6 box_2 box_9 - box workstation_0 - workstation warehouse_0 - warehouse tool bolt valve - supply_type )
  (:init (adjacent l0_1 l0_2) (adjacent l3_4 l4_4) (adjacent l3_1 l2_1) (adjacent l2_1 l2_0) (adjacent l3_1 l3_2) (at box_3 l2_3) (adjacent l1_1 l1_0) (adjacent l0_3 l0_4) (adjacent l3_0 l2_0) (empty box_0) (adjacent l3_0 l4_0) (adjacent l2_4 l3_4) (adjacent l1_0 l2_0) (empty box_1) (at warehouse_0 l2_3) (is supply_0 valve) (adjacent l2_4 l2_3) (adjacent l4_1 l3_1) (adjacent l1_4 l2_4) (adjacent l2_4 l1_4) (adjacent l3_4 l3_3) (adjacent l2_2 l1_2) (adjacent l3_2 l4_2) (adjacent l3_2 l2_2) (adjacent l0_4 l0_3) (adjacent l2_3 l3_3) (adjacent l1_0 l0_0) (adjacent l2_1 l1_1) (adjacent l1_2 l1_1) (adjacent l4_3 l4_4) (adjacent l2_3 l2_4) (adjacent l0_3 l1_3) (adjacent l1_2 l0_2) (adjacent l4_3 l4_2) (at box_6 l2_3) (adjacent l1_3 l2_3) (adjacent l3_3 l3_2) (adjacent l3_2 l3_3) (adjacent l0_0 l0_1) (empty box_4) (adjacent l3_3 l4_3) (adjacent l2_1 l3_1) (adjacent l1_2 l1_3) (adjacent l0_4 l1_4) (adjacent l3_4 l2_4) (empty box_6) (adjacent l4_2 l4_1) (adjacent l4_4 l3_4) (adjacent l4_3 l3_3) (adjacent l1_1 l0_1) (adjacent l0_2 l0_1) (empty box_2) (adjacent l4_1 l4_2) (empty box_5) (adjacent l2_0 l1_0) (adjacent l0_2 l0_3) (at box_9 l2_3) (adjacent l3_2 l3_1) (at box_7 l2_3) (adjacent l2_1 l2_2) (at workstation_0 l2_4) (adjacent l0_0 l1_0) (at box_2 l2_3) (at supply_1 l2_3) (adjacent l3_3 l2_3) (at box_0 l2_3) (adjacent l3_0 l3_1) (adjacent l0_3 l0_2) (adjacent l4_0 l4_1) (at supply_2 l2_3) (adjacent l1_4 l1_3) (adjacent l1_3 l1_2) (adjacent l1_0 l1_1) (adjacent l4_4 l4_3) (is supply_2 tool) (adjacent l4_2 l4_3) (empty box_8) (empty box_7) (adjacent l0_2 l1_2) (adjacent l2_2 l2_3) (adjacent l1_4 l0_4) (at box_1 l2_3) (adjacent l1_3 l0_3) (adjacent l2_0 l3_0) (adjacent l2_0 l2_1) (adjacent l3_1 l4_1) (is supply_1 bolt) (adjacent l1_2 l2_2) (adjacent l4_1 l4_0) (adjacent l2_2 l2_1) (adjacent l1_1 l1_2) (empty box_9) (at agent_0 l2_3) (adjacent l2_3 l1_3) (adjacent l3_1 l3_0) (adjacent l2_2 l3_2) (adjacent l3_3 l3_4) (adjacent l4_2 l3_2) (at box_8 l2_3) (free_arms agent_0) (at supply_0 l2_3) (at box_5 l2_3) (adjacent l1_3 l1_4) (adjacent l0_1 l1_1) (adjacent l1_1 l2_1) (adjacent l0_1 l0_0) (empty box_3) (at box_4 l2_3) (adjacent l2_3 l2_2) (adjacent l4_0 l3_0))
  (:goal (and (has workstation_0 valve) (has workstation_0 tool) (has workstation_0 bolt)))
)

; plan
1. (take_box agent_0 box_9 l2_3)
   deleted: (free_arms agent_0) (at box_9 l2_3)
   added: (box_carried_by box_9 agent_0)
   goals met: 0 of 3
2. (fill_box agent_0 box_9 supply_0 l2_3)
   deleted: (empty box_9) (at supply_0 l2_3)
   added: (contains box_9 supply_0)
   goals met: 0 of 3
3. (move agent_0 l2_3 l2_4)
   deleted: (at agent_0 l2_3)
   added: (at agent_0 l2_4)
   goals met: 0 of 3
4. (deliver_box agent_0 box_9 workstation_0 l2_4)
   deleted: (box_carried_by box_9 agent_0)
   added: (free_arms agent_0) (unloaded_box box_9 workstation_0)
   goals met: 0 of 3
5. (deliver_supply agent_0 workstation_0 valve supply_0 box_9 l2_4)
   deleted: (contains box_9 supply_0) (unloaded_box box_9 workstation_0)
   added: (loaded_to supply_0 workstation_0) (empty box_9) (at box_9 l2_4) (has workstation_0 valve)
   goals met: 1 of 3
6. (move agent_0 l2_4 l2_3)
   deleted: (at agent_0 l2_4)
   added: (at agent_0 l2_3)
   goals met: 1 of 3
7. (take_box agent_0 box_8 l2_3)
   deleted: (free_arms agent_0) (at box_8 l2_3)
   added: (box_carried_by box_8 agent_0)
   goals met: 1 of 3
8. (move agent_0 l2_3 l2_4)
   deleted: (at agent_0 l2_3)
   added: (at agent_0 l2_4)
   goals met: 1 of 3
9. (deliver_box agent_0 box_8 workstation_0 l2_4)
   deleted: (box_carried_by box_8 agent_0)
   added: (free_arms agent_0) (unloaded_box box_8 workstation_0)
   goals met: 1 of 3
10. (move agent_0 l2_4 l2_3)
   deleted: (at agent_0 l2_4)
   added: (at agent_0 l2_3)
   goals met: 1 of 3
11. (take_box agent_0 box_7 l2_3)
   deleted: (free_arms agent_0) (at box_7 l2_3)
   added: (box_carried_by box_7 agent_0)
   goals met: 1 of 3
12. (move agent_0 l2_3 l2_4)
   deleted: (at agent_0 l2_3)
   added: (at agent_0 l2_4)
   goals met: 1 of 3
13. (deliver_box agent_0 box_7 workstation_0 l2_4)
   deleted: (box_carried_by box_7 agent_0)
   added: (free_arms agent_0) (unloaded_box box_7 workstation_0)
   goals met: 1 of 3
14. (move agent_0 l2_4 l2_3)
   deleted: (at agent_0 l2_4)
   added: (at agent_0 l2_3)
   goals met: 1 of 3
15. (take_box agent_0 box_6 l2_3)
   deleted: (free_arms agent_0) (at box_6 l2_3)
   added: (box_carried_by box_6 agent_0)
   goals met: 1 of 3
16. (move agent_0 l2_3 l2_4)
   deleted: (at agent_0 l2_3)
   added: (at agent_0 l2_4)
   goals met: 1 of 3
17. (deliver_box agent_0 box_6 workstation_0 l2_4)
   deleted: (box_carried_by box_6 agent_0)
   added: (free_arms agent_0) (unloaded_box box_6 workstation_0)
   goals met: 1 of 3
18. (move agent_0 l2_4 l2_3)
   deleted: (at agent_0 l2_4)
   added: (at agent_0 l2_3)
   goals met: 1 of 3
19. (take_box agent_0 box_5 l2_3)
   deleted: (free_arms agent_0) (at box_5 l2_3)
   added: (box_carried_by box_5 agent_0)
   goals met: 1 of 3
20. (move agent_0 l2_3 l2_4)
   deleted: (at agent_0 l2_3)
   added: (at agent_0 l2_4)
   goals met: 1 of 3
21. (deliver_box agent_0 box_5 workstation_0 l2_4)
   deleted: (box_carried_by box_5 agent_0)
   added: (free_arms agent_0) (unloaded_box box_5 workstation_0)
   goals met: 1 of 3
22. (move agent_0 l2_4 l2_3)
   deleted: (at agent_0 l2_4)
   added: (at agent_0 l2_3)
   goals met: 1 of 3
23. (take_box agent_0 box_4 l2_3)
   deleted: (free_arms agent_0) (at box_4 l2_3)
   added: (box_carried_by box_4 agent_0)
   goals met: 1 of 3
24. (move agent_0 l2_3 l2_4)
   deleted: (at agent_0 l2_3)
   added: (at agent_0 l2_4)
   goals met: 1 of 3
25. (deliver_box agent_0 box_4 workstation_0 l2_4)
   deleted: (box_carried_by box_4 agent_0)
   added: (free_arms agent_0) (unloaded_box box_4 workstation_0)
   goals met: 1 of 3
26. (move agent_0 l2_4 l2_3)
   deleted: (at agent_0 l2_4)
   added: (at agent_0 l2_3)
   goals met: 1 of 3
27. (take_box agent_0 box_3 l2_3)
   deleted: (free_arms agent_0) (at box_3 l2_3)
   added: (box_carried_by box_3 agent_0)
   goals met: 1 of 3
28. (move agent_0 l2_3 l2_4)
   deleted: (at agent_0 l2_3)
   added: (at agent_0 l2_4)
   goals met: 1 of 3
29. (deliver_box agent_0 box_3 workstation_0 l2_4)
   deleted: (box_carried_by box_3 agent_0)
   added: (free_arms agent_0) (unloaded_box box_3 workstation_0)
   goals met: 1 of 3
30. (move agent_0 l2_4 l2_3)
   deleted: (at agent_0 l2_4)
   added: (at agent_0 l2_3)
   goals met: 1 of 3
31. (take_box agent_0 box_2 l2_3)
   deleted: (free_arms agent_0) (at box_2 l2_3)
   added: (box_carried_by box_2 agent_0)
   goals met: 1 of 3
32. (move agent_0 l2_3 l2_4)
   deleted: (at agent_0 l2_3)
   added: (at agent_0 l2_4)
   goals met: 1 of 3
33. (deliver_box agent_0 box_2 workstation_0 l2_4)
   deleted: (box_carried_by box_2 agent_0)
   added: (free_arms agent_0) (unloaded_box box_2 workstation_0)
   goals met: 1 of 3
34. (move agent_0 l2_4 l2_3)
   deleted: (at agent_0 l2_4)
   added: (at agent_0 l2_3)
   goals met: 1 of 3
35. (take_box agent_0 box_1 l2_3)
   deleted: (free_arms agent_0) (at box_1 l2_3)
   added: (box_carried_by box_1 agent_0)
   goals met: 1 of 3
36. (move agent_0 l2_3 l2_4)
   deleted: (at agent_0 l2_3)
   added: (at agent_0 l2_4)
   goals met: 1 of 3
37. (deliver_box agent_0 box_1 workstation_0 l2_4)
   deleted: (box_carried_by box_1 agent_0)
   added: (free_arms agent_0) (unloaded_box box_1 workstation_0)
   goals met: 1 of 3
38. (move agent_0 l2_4 l2_3)
   deleted: (at agent_0 l2_4)
   added: (at agent_0 l2_3)
   goals met: 1 of 3
39. (take_box agent_0 box_0 l2_3)
   deleted: (free_arms agent_0) (at box_0 l2_3)
   added: (box_carried_by box_0 agent_0)
   goals met: 1 of 3
40. (fill_box agent_0 box_0 supply_1 l2_3)
   deleted: (empty box_0) (at supply_1 l2_3)
   added: (contains box_0 supply_1)
   goals met: 1 of 3
41. (move agent_0 l2_3 l2_4)
   deleted: (at agent_0 l2_3)
   added: (at agent_0 l2_4)
   goals met: 1 of 3
42. (deliver_box agent_0 box_0 workstation_0 l2_4)
   deleted: (box_carried_by box_0 agent_0)
   added: (free_arms agent_0) (unloaded_box box_0 workstation_0)
   goals met: 1 of 3
43. (deliver_supply agent_0 workstation_0 bolt supply_1 box_0 l2_4)
   deleted: (contains box_0 supply_1) (unloaded_box box_0 workstation_0)
   added: (loaded_to supply_1 workstation_0) (empty box_0) (at box_0 l2_4) (has workstation_0 bolt)
   goals met: 2 of 3
44. (take_box agent_0 box_9 l2_4)
   deleted: (free_arms agent_0) (at box_9 l2_4)
   added: (box_carried_by box_9 agent_0)
   goals met: 2 of 3
45. (move agent_0 l2_4 l2_3)
   deleted: (at agent_0 l2_4)
   added: (at agent_0 l2_3)
   goals met: 2 of 3
46. (fill_box agent_0 box_9 supply_2 l2_3)
   deleted: (empty box_9) (at supply_2 l2_3)
   added: (contains box_9 supply_2)
   goals met: 2 of 3
47. (move agent_0 l2_3 l2_4)
   deleted: (at agent_0 l2_3)
   added: (at agent_0 l2_4)
   goals met: 2 of 3
48. (deliver_box agent_0 box_9 workstation_0 l2_4)
   deleted: (box_carried_by box_9 agent_0)
   added: (free_arms agent_0) (unloaded_box box_9 workstation_0)
   goals met: 2 of 3
49. (deliver_supply agent_0 workstation_0 tool supply_2 box_9 l2_4)
   deleted: (contains box_9 supply_2) (unloaded_box box_9 workstation_0)
   added: (loaded_to supply_2 workstation_0) (empty box_9) (at box_9 l2_4) (has workstation_0 tool)
   goals met: 3 of 3
